일단 두 수를 보고,
10 12,
이 두 수에 대해서 최소공배수와 최대 공약수에 대해서 생각해볼까
일단 최대 공약수는
gcd(12,10)=gcd(10,2)=gcd(2,0)=2;
그렇다면 최소공배수는?
12*10=gcd*최소공배수=2*최소공배수
그러므로 최소공배수는 60 이다
그런데 이 문제에서, 10 :12 는 마지막인 60번째 해를 나타낸다고 했으므로, 
최소공배수 만큼이 되는것으로 보여진다. 

그렇담 최소 공배수 60이 되기 위해서, 
10은 1부터 시작해서 10이 되는게 1바퀴라고 치면, 6바퀴를 돌것이고, 
12는 1부터 시작해서 12가 되는것이 1바퀴라면, 5바퀴를 돌이것이다. 

3 과 9는 차이가 6이고, 
6이라는 수는 10과 12가 10이 한바돌고 2가 더 나가야 12가 되니까, 
10이 3바퀴를 돌면, 
30 

1/1
2/2
3/3
4/4
5/5
6/6
7/7
8/8
9/9
10/10 ==10
1/11
2/12
3/1
4/2
5/3
6/4
7/5
8/6
9/7
10/8 ==20
1/9
2/10
3/11
4/12
5/1
6/2
7/3
8/4
9/5
10/6 ==30
1/7
2/8
3/9
4/10
5/11
6/12
7/1
8/2
9/3
10/4 ==40
1/5
2/6
3/7
4/8
5/9
6/10
7/11
8/12
9/1
10/2 ==50
1/3
2/4
3/5
4/6
5/7
6/8
7/9
8/10
9/11
10/12 ==60 끝.
